In [8]:
%load_ext sql
import os

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [10]:
from os import getenv

In [11]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://raed:***@localhost/sparkify
5 rows affected.

[(0, datetime.datetime(2018, 11, 27, 0, 52, 12, 796000), 88, 'paid', None, None, 961, 'Sacramento--Roseville--Arden-Arcade, CA', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (1, datetime.datetime(2018, 11, 27, 0, 56, 49, 796000), 88, 'paid', None, None, 961, 'Sacramento--Roseville--Arden-Arcade, CA', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (2, datetime.datetime(2018, 11, 27, 1, 0, 48, 796000), 88, 'paid', None, None, 961, 'Sacramento--Roseville--Arden-Arcade, CA', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (3, datetime.datetime(2018, 11, 27, 1, 33, 16, 796000), 38, 'free', None, None, 107, 'New York-Newark-Jersey City, NY-NJ-PA', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 (4, datetime.datetime(2018, 11, 27, 1, 38, 37, 796000), 38, 'free', None, None, 107, 'New York-Newark-Jersey City, NY-NJ-PA', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"')]

In [12]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://raed:***@localhost/sparkify
5 rows affected.

[(8, 'Kaylee', 'Summers', 'F', 'free'),
 (66, 'Kevin', 'Arellano', 'M', 'free'),
 (16, 'Rylan', 'George', 'M', 'free'),
 (86, 'Aiden', 'Hess', 'M', 'free'),
 (38, 'Gianna', 'Jones', 'F', 'free')]

In [15]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://raed:***@localhost/sparkify
5 rows affected.

[('SOXVLOJ12AB0189215', 'Amor De Cabaret', 'ARKRRTF1187B9984DA', 0, 177.47546),
 ('SOMZWCG12A8C13C480', "I Didn't Mean To", 'ARD7TVE1187B99BFB1', 0, 218.9318),
 ('SOHKNRJ12A6701D1F8', 'Drop of Rain', 'AR10USD1187B99F3F1', 0, 189.57016),
 ('SOQHXMF12AB0182363', 'Young Boy Blues', 'ARGSJW91187B9B1D6B', 0, 218.77505),
 ('SOIAZJW12AB01853F1', 'Pink World', 'AR8ZCNI1187B9A069B', 1984, 269.81833)]

In [16]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://raed:***@localhost/sparkify
5 rows affected.

[('ARKRRTF1187B9984DA', 'Sonora Santanera', '', nan, nan),
 ('ARD7TVE1187B99BFB1', 'Casual', 'California - LA', nan, nan),
 ('AR10USD1187B99F3F1', 'Tweeterfriendly Music', 'Burlington, Ontario, Canada', nan, nan),
 ('ARGSJW91187B9B1D6B', 'JennyAnyKind', 'North Carolina', 35.21962, -80.01955),
 ('AR8ZCNI1187B9A069B', 'Planet P Project', '', nan, nan)]